[
  {
    "query": "I am employed with ₹1 lakh monthly salary and want to visit France for 10 days. Am I eligible?",
    "user_profile": {}
  },
  {
    "query": "Can I stay longer by extending my visitor visa?",
    "user_profile": {}
  },
  {
    "query": "I have a valid UK visa and sufficient funds. Am I eligible for Schengen short-stay visa?",
    "user_profile": {}
  },
  {
    "query": "Do I qualify for visa if my accommodation is not finalized?",
    "user_profile": {}
  },
  {
    "query": "I have a job offer but my CoS is delayed — can I still apply?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for UK spouse visa if I earn in foreign currency?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen visa if my documents are in Hindi?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible if I don’t have income tax returns?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for tourist visa if I already have Schengen refusal?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for H1B visa without a bachelor’s degree but 10 years experience?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for visitor visa if I’m unemployed?",
    "user_profile": {}
  },
  {
    "query": "Can I get study visa with 1 year gap?",
    "user_profile": {}
  },
  {
    "query": "Can I travel all Schengen countries with single-country visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK fiancé visa if we have met only once?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for an H4 EAD if my spouse’s I-140 is not approved?",
    "user_profile": {}
  },
  {
    "query": "Can I apply without confirmed bookings?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Schengen visa if I’m a student in India?",
    "user_profile": {}
  },
  {
    "query": "I have LMIA-approved job offer as a software engineer. Am I eligible for work permit?",
    "user_profile": {}
  },
  {
    "query": "My spouse holds Stamp 4 and we are legally married. Am I eligible for dependent visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Stamp 1G after completing master’s?",
    "user_profile": {}
  },
  {
    "query": "Can I get a UK visa if I have a US refusal from last year?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for visa if I have US refusal?",
    "user_profile": {}
  },
  {
    "query": "My salary offer for Critical Skills Permit is €45,000 for ICT category. Am I eligible?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for J1 visa if I have already done a J1 previously?",
    "user_profile": {}
  },
  {
    "query": "I’m from India, can I get a UK tourist visa if I have 3 months of bank statements only?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Critical Skills Permit with €28k salary?",
    "user_profile": {}
  },
  {
    "query": "Can I switch from tourist visa to work visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Ireland Study Visa with 60% in bachelors?",
    "user_profile": {}
  },
  {
    "query": "I have confirmed flight + hotel booking, insurance, and ₹3 lakh funds. Am I eligible for Schengen tourist visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen visa for 20-day trip?",
    "user_profile": {}
  },
  {
    "query": "I completed my Master’s in Ireland and have official results. Am I eligible for Stamp 1G?",
    "user_profile": {}
  },
  {
    "query": "My parents meet LICO requirements and have medical insurance purchased. Am I eligible for Super Visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK Visitor Visa if my passport expires in 5 months?",
    "user_profile": {}
  },
  {
    "query": "I have $15,000 savings — can I apply for US B2 visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for DV lottery if I’m from India?",
    "user_profile": {}
  },
  {
    "query": "I have a bachelor’s degree in Computer Science and a US employer offering prevailing wage. Am I eligible for H1B?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for multiple-entry visa on first attempt?",
    "user_profile": {}
  },
  {
    "query": "Can I bring my spouse on a UK dependent visa if my salary is £23k?",
    "user_profile": {}
  },
  {
    "query": "I have a UK Skilled Worker job offer with salary £32,000 and CoS from a licensed sponsor. Am I eligible?",
    "user_profile": {}
  },
  {
    "query": "My college program is 2 years long and DLI-approved. Am I eligible for PGWP?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Express Entry if my education is from open university?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Schengen visa with sponsorship from friend?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for H1B if I worked part-time last year?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Schengen using Ireland study visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Canada visitor visa with no travel history?",
    "user_profile": {}
  },
  {
    "query": "My partner is working in Germany on work permit and I want to visit him. Am I eligible for family visit visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Schengen if my passport expires in 5 months?",
    "user_profile": {}
  },
  {
    "query": "My employer is sending me for a 7-day business trip with invitation. Am I eligible for business Schengen visa?",
    "user_profile": {}
  },
  {
    "query": "Do I need a job offer from a licensed sponsor for a Skilled Worker Visa?",
    "user_profile": {}
  },
  {
    "query": "I want to visit USA for tourism, have $20,000 savings and full-time job. Am I eligible for B2 visa?",
    "user_profile": {}
  },
  {
    "query": "I’m from an eligible country for DV and have high school education. Am I eligible for DV lottery?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for dependent visa if my spouse is on Stamp 4?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen tourist visa with no travel history?",
    "user_profile": {}
  },
  {
    "query": "Can I bring my wife on F2 visa while studying in the US?",
    "user_profile": {}
  },
  {
    "query": "Do I need medical exam for visitor visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for business visa with invitation letter only?",
    "user_profile": {}
  },
  {
    "query": "I had a Schengen refusal. Will this affect my US visa?",
    "user_profile": {}
  },
  {
    "query": "I have NOC B experience for 3 years. Am I eligible for Express Entry FSW?",
    "user_profile": {}
  },
  {
    "query": "I got admission for a certified 3-month course in Germany and have acceptance letter. Am I eligible for Schengen study visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for H1B with salary paid in foreign currency?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for spouse visa while on Stamp 1G?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen visa if unmarried but traveling with partner?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for PGWP if my program is 8 months long?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible with old passport having 2 blank pages only?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Skilled Worker Visa if my job is at RQF Level 4?",
    "user_profile": {}
  },
  {
    "query": "Do I qualify for a UK Startup visa if my business plan is not approved yet?",
    "user_profile": {}
  },
  {
    "query": "I studied in a university on the HPI approved list. Am I eligible for the HPI visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for work permit without job offer letter?",
    "user_profile": {}
  },
  {
    "query": "I want to visit Ireland for tourism and have strong financials and travel history. Am I eligible?",
    "user_profile": {}
  },
  {
    "query": "I overstayed earlier. Can I still apply for a US tourist visa?",
    "user_profile": {}
  },
  {
    "query": "I have an offer from an Irish university, funds, and accommodation. Am I eligible for study visa?",
    "user_profile": {}
  },
  {
    "query": "Do I qualify for a Graduate Trainee Visa if my company doesn’t have an overseas branch?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen visa with 1 lakh bank balance?",
    "user_profile": {}
  },
  {
    "query": "I work for an MNC abroad for 2 years and they want to transfer me to US branch. Am I eligible for L1 visa?",
    "user_profile": {}
  },
  {
    "query": "My spouse is studying in Canada and has a valid study permit. Am I eligible for spouse open work permit?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for a UK Student Visa with an IELTS overall 5.5 score?",
    "user_profile": {}
  },
  {
    "query": "Can I bring my parents on B2 visa for graduation ceremony?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for TRV if I am a freelancer?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for a dependent visa if I’m living with my partner but not legally married?",
    "user_profile": {}
  },
  {
    "query": "I completed a 1-year program in Canada and have a full-time skilled job offer. Am I eligible for CEC PR?",
    "user_profile": {}
  },
  {
    "query": "Do I qualify for Express Entry with CRS score of 380?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for long-stay visa through Netherlands?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for UK Global Talent Visa without awards but with strong publications?",
    "user_profile": {}
  },
  {
    "query": "I want to visit my sister in London. Am I eligible for a family visitor visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for dependent visa if married recently?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK Family Visa if my partner earns minimum wage?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Ireland Tourist Visa with 2 lakhs bank balance?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for work permit after visitor visa?",
    "user_profile": {}
  },
  {
    "query": "My employer is not on the sponsor list — can I still apply?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for visa if my passport expires in 8 months?",
    "user_profile": {}
  },
  {
    "query": "Do I qualify for a UK student visa with distance learning course?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for EB-3 visa as a chef?",
    "user_profile": {}
  },
  {
    "query": "Can I get a US visa if my bank balance is low but sponsor will pay?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for F1 visa with a 3-year bachelor’s degree?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen work visa with 1 year experience?",
    "user_profile": {}
  },
  {
    "query": "My US citizen sister invited me, and I have sufficient ties and travel history. Am I eligible for B2 visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for PR as a cook under NOC?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for work permit if salary is paid in cash?",
    "user_profile": {}
  },
  {
    "query": "Do I qualify for Schengen Visa if I’m self-employed?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Ireland work permit as a chef?",
    "user_profile": {}
  },
  {
    "query": "I am a registered nurse with a UK Health & Care Worker job offer and salary £27,000. Am I eligible?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for short stay visa with no travel history?",
    "user_profile": {}
  },
  {
    "query": "Can I switch from UK student visa to skilled worker visa without completing my degree?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK Transit Visa while traveling to Canada?",
    "user_profile": {}
  },
  {
    "query": "My UK Master’s degree is completed and I have the final mark sheet. Am I eligible for the Graduate Route?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for job seeker visa in Ireland?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for US visa if my passport has only 1 year validity left?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK Health and Care Worker visa with 1 year experience as a nurse?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for H1B if my employer is a small startup?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for B1 visa for business meeting with only invitation letter?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Dependent/Partner visa without marriage registered?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for work permit if my employer is not verified?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for re-entry visa as an Indian?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Express Entry with 1 year experience as a data analyst?",
    "user_profile": {}
  },
  {
    "query": "Can I apply if I’m already holding UK visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK startup visa if I’m already running my company from India?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a UK Skilled Worker visa if my salary is £28,000 and I have a job offer in Manchester?",
    "user_profile": {}
  },
  {
    "query": "Can I travel on B1/B2 for attending my sister’s wedding?",
    "user_profile": {}
  },
  {
    "query": "I earn £30,000 and my wife and I are legally married. Can she apply for a dependent visa?",
    "user_profile": {}
  },
  {
    "query": "Can I travel to UK with Ireland visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Critical Skills Permit with 2 years experience only?",
    "user_profile": {}
  },
  {
    "query": "I hold a valid US visa and have good travel history. Am I eligible for Schengen tourist visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for business visa with only invitation email?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Schengen study visa for short course?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Canada Study Permit with 5.5 IELTS in one module?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for F1 Visa with IELTS score instead of TOEFL?",
    "user_profile": {}
  },
  {
    "query": "I have £10,000 funds and CAS from a UK university for September intake. Am I eligible for UK Student Visa?",
    "user_profile": {}
  },
  {
    "query": "Can I bring my spouse under open work permit while I study?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Canada work visa as a truck driver?",
    "user_profile": {}
  },
  {
    "query": "Do I need job experience to get H1B?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for L1 visa if my company does not have a US branch?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Ireland visa if my passport expires soon?",
    "user_profile": {}
  },
  {
    "query": "I have IELTS 7.0 in all bands and CRS score 490. Am I eligible for Express Entry?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for H1B transfer without paystubs?",
    "user_profile": {}
  },
  {
    "query": "My spouse is on H1B and has an approved I-140. Am I eligible for H4 EAD?",
    "user_profile": {}
  },
  {
    "query": "I am an international award-winning researcher with strong citation record. Am I eligible for O1 visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for study visa with Duolingo score?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for spouse visa without marriage certificate?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for a UK Graduate Route visa if my results are not declared but course is completed?",
    "user_profile": {}
  },
  {
    "query": "Can I get Schengen visa if I have US visa refusal?",
    "user_profile": {}
  },
  {
    "query": "I have a job offer above €30,000 and degree qualification. Am I eligible for General Work Permit?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible if my salary is in foreign currency?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for internship visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for HPI visa? I studied in top university in India.",
    "user_profile": {}
  },
  {
    "query": "I want to visit Canada and have funds, job, and travel history. Am I eligible for visitor visa?",
    "user_profile": {}
  },
  {
    "query": "Can I bring my dependent on Stamp 2 visa?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for a US tourist visa if I am a student with no job?",
    "user_profile": {}
  },
  {
    "query": "Can I get PR through PNP with 2 years of experience?",
    "user_profile": {}
  },
  {
    "query": "My company has an office in Ireland and wants to transfer me. Am I eligible for intra-company permit?",
    "user_profile": {}
  },
  {
    "query": "I completed 2 years on Stamp 1G and have full-time job offer. Am I eligible for Stamp 1?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Schengen without travel insurance?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for Super Visa if my income is below LICO?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for CUAET if I’m not Ukrainian?",
    "user_profile": {}
  },
  {
    "query": "My partner is British and we meet the £29,000 income requirement. Am I eligible for UK Spouse Visa?",
    "user_profile": {}
  },
  {
    "query": "I studied online during Covid — can I still get PGWP?",
    "user_profile": {}
  },
  {
    "query": "Can I apply through France if visiting Germany mostly?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible if I’m sponsored by company?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for F1 visa with gap years?",
    "user_profile": {}
  },
  {
    "query": "Am I eligible for SDS category if I don’t have GIC?",
    "user_profile": {}
  },
  {
    "query": "I have a valid US visa and confirmed flight with 3-hour layover in London. Am I eligible for UK Transit Visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for work permit without LMIA?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for Schengen visa if I live in Dubai on work permit?",
    "user_profile": {}
  },
  {
    "query": "I got admission to a US university, paid SEVIS fee, and have I-20. Am I eligible for F1 visa?",
    "user_profile": {}
  },
  {
    "query": "Can I apply for O1 visa without international awards?",
    "user_profile": {}
  },
  {
    "query": "I have booked a cruise covering Italy and Greece, and have full travel insurance. Am I eligible?",
    "user_profile": {}
  }
]