[
  {
    "query": "I am employed with ₹1 lakh monthly salary and want to visit France for 10 days. Am I eligible?"
  },
  {
    "query": "Can I stay longer by extending my visitor visa?"
  },
  {
    "query": "I have a valid UK visa and sufficient funds. Am I eligible for Schengen short-stay visa?"
  },
  {
    "query": "Am I eligible for Schengen visa if my documents are in Hindi?"
  },
  {
    "query": "Am I eligible for tourist visa if I already have Schengen refusal?"
  },
  {
    "query": "Am I eligible for H1B visa without a bachelor’s degree but 10 years experience?"
  },
  {
    "query": "Can I get study visa with 1 year gap?"
  },
  {
    "query": "Can I travel all Schengen countries with single-country visa?"
  },
  {
    "query": "Am I eligible for a UK fiancé visa if we have met only once?"
  },
  {
    "query": "Can I apply without confirmed bookings?"
  },
  {
    "query": "Can I apply for Schengen visa if I’m a student in India?"
  },
  {
    "query": "I have LMIA-approved job offer as a software engineer. Am I eligible for work permit?"
  },
  {
    "query": "Am I eligible for Stamp 1G after completing master’s?"
  },
  {
    "query": "Am I eligible for visa if I have US refusal?"
  },
  {
    "query": "My salary offer for Critical Skills Permit is €45,000 for ICT category. Am I eligible?"
  },
  {
    "query": "I’m from India, can I get a UK tourist visa if I have 3 months of bank statements only?"
  },
  {
    "query": "Am I eligible for Critical Skills Permit with €28k salary?"
  },
  {
    "query": "Can I switch from tourist visa to work visa?"
  },
  {
    "query": "I have confirmed flight + hotel booking, insurance, and ₹3 lakh funds. Am I eligible for Schengen tourist visa?"
  },
  {
    "query": "Am I eligible for Schengen visa for 20-day trip?"
  },
  {
    "query": "I completed my Master’s in Ireland and have official results. Am I eligible for Stamp 1G?"
  },
  {
    "query": "My parents meet LICO requirements and have medical insurance purchased. Am I eligible for Super Visa?"
  },
  {
    "query": "Am I eligible for a UK Visitor Visa if my passport expires in 5 months?"
  },
  {
    "query": "I have $15,000 savings — can I apply for US B2 visa?"
  },
  {
    "query": "I have a bachelor’s degree in Computer Science and a US employer offering prevailing wage. Am I eligible for H1B?"
  },
  {
    "query": "I have a UK Skilled Worker job offer with salary £32,000 and CoS from a licensed sponsor. Am I eligible?"
  },
  {
    "query": "My college program is 2 years long and DLI-approved. Am I eligible for PGWP?"
  },
  {
    "query": "Can I apply for Express Entry if my education is from open university?"
  },
  {
    "query": "Can I apply for Schengen visa with sponsorship from friend?"
  },
  {
    "query": "Can I apply for H1B if I worked part-time last year?"
  },
  {
    "query": "Can I apply for Schengen using Ireland study visa?"
  },
  {
    "query": "Am I eligible for Canada visitor visa with no travel history?"
  },
  {
    "query": "My partner is working in Germany on work permit and I want to visit him. Am I eligible for family visit visa?"
  },
  {
    "query": "Can I apply for Schengen if my passport expires in 5 months?"
  },
  {
    "query": "My employer is sending me for a 7-day business trip with invitation. Am I eligible for business Schengen visa?"
  },
  {
    "query": "Do I need a job offer from a licensed sponsor for a Skilled Worker Visa?"
  },
  {
    "query": "I want to visit USA for tourism, have $20,000 savings and full-time job. Am I eligible for B2 visa?"
  },
  {
    "query": "I’m from an eligible country for DV and have high school education. Am I eligible for DV lottery?"
  },
  {
    "query": "Can I apply for dependent visa if my spouse is on Stamp 4?"
  },
  {
    "query": "Am I eligible for Schengen tourist visa with no travel history?"
  },
  {
    "query": "Can I bring my wife on F2 visa while studying in the US?"
  },
  {
    "query": "Do I need medical exam for visitor visa?"
  },
  {
    "query": "I had a Schengen refusal. Will this affect my US visa?"
  },
  {
    "query": "Am I eligible for Schengen visa if unmarried but traveling with partner?"
  },
  {
    "query": "Am I eligible for PGWP if my program is 8 months long?"
  },
  {
    "query": "Do I qualify for a UK Startup visa if my business plan is not approved yet?"
  },
  {
    "query": "I studied in a university on the HPI approved list. Am I eligible for the HPI visa?"
  },
  {
    "query": "I want to visit Ireland for tourism and have strong financials and travel history. Am I eligible?"
  },
  {
    "query": "I have an offer from an Irish university, funds, and accommodation. Am I eligible for study visa?"
  },
  {
    "query": "Am I eligible for Schengen visa with 1 lakh bank balance?"
  },
  {
    "query": "I work for an MNC abroad for 2 years and they want to transfer me to US branch. Am I eligible for L1 visa?"
  },
  {
    "query": "Can I apply for a UK Student Visa with an IELTS overall 5.5 score?"
  },
  {
    "query": "Can I bring my parents on B2 visa for graduation ceremony?"
  },
  {
    "query": "Am I eligible for TRV if I am a freelancer?"
  },
  {
    "query": "Can I apply for a dependent visa if I’m living with my partner but not legally married?"
  },
  {
    "query": "Can I apply for long-stay visa through Netherlands?"
  },
  {
    "query": "Am I eligible for UK Global Talent Visa without awards but with strong publications?"
  },
  {
    "query": "I want to visit my sister in London. Am I eligible for a family visitor visa?"
  },
  {
    "query": "Am I eligible for work permit after visitor visa?"
  },
  {
    "query": "My employer is not on the sponsor list — can I still apply?"
  },
  {
    "query": "Can I apply for visa if my passport expires in 8 months?"
  },
  {
    "query": "Am I eligible for EB-3 visa as a chef?"
  },
  {
    "query": "Can I get a US visa if my bank balance is low but sponsor will pay?"
  },
  {
    "query": "Can I apply for PR as a cook under NOC?"
  },
  {
    "query": "Do I qualify for Schengen Visa if I’m self-employed?"
  },
  {
    "query": "Am I eligible for Ireland work permit as a chef?"
  },
  {
    "query": "Can I apply for short stay visa with no travel history?"
  },
  {
    "query": "Can I switch from UK student visa to skilled worker visa without completing my degree?"
  },
  {
    "query": "My UK Master’s degree is completed and I have the final mark sheet. Am I eligible for the Graduate Route?"
  },
  {
    "query": "Am I eligible for job seeker visa in Ireland?"
  },
  {
    "query": "Am I eligible for US visa if my passport has only 1 year validity left?"
  },
  {
    "query": "Am I eligible for a UK Health and Care Worker visa with 1 year experience as a nurse?"
  },
  {
    "query": "Can I apply for H1B if my employer is a small startup?"
  },
  {
    "query": "Am I eligible for Dependent/Partner visa without marriage registered?"
  },
  {
    "query": "Am I eligible for re-entry visa as an Indian?"
  },
  {
    "query": "Can I apply for Express Entry with 1 year experience as a data analyst?"
  },
  {
    "query": "Can I apply if I’m already holding UK visa?"
  },
  {
    "query": "Am I eligible for a UK startup visa if I’m already running my company from India?"
  },
  {
    "query": "Am I eligible for a UK Skilled Worker visa if my salary is £28,000 and I have a job offer in Manchester?"
  },
  {
    "query": "Can I travel on B1/B2 for attending my sister’s wedding?"
  },
  {
    "query": "Can I travel to UK with Ireland visa?"
  },
  {
    "query": "Am I eligible for Canada Study Permit with 5.5 IELTS in one module?"
  },
  {
    "query": "Can I apply for F1 Visa with IELTS score instead of TOEFL?"
  },
  {
    "query": "I have £10,000 funds and CAS from a UK university for September intake. Am I eligible for UK Student Visa?"
  },
  {
    "query": "Am I eligible for L1 visa if my company does not have a US branch?"
  },
  {
    "query": "Can I apply for Ireland visa if my passport expires soon?"
  },
  {
    "query": "I am an international award-winning researcher with strong citation record. Am I eligible for O1 visa?"
  },
  {
    "query": "Can I get Schengen visa if I have US visa refusal?"
  },
  {
    "query": "Am I eligible if my salary is in foreign currency?"
  },
  {
    "query": "Can I apply for HPI visa? I studied in top university in India."
  },
  {
    "query": "Can I bring my dependent on Stamp 2 visa?"
  },
  {
    "query": "My company has an office in Ireland and wants to transfer me. Am I eligible for intra-company permit?"
  },
  {
    "query": "I completed 2 years on Stamp 1G and have full-time job offer. Am I eligible for Stamp 1?"
  },
  {
    "query": "Can I apply for Schengen without travel insurance?"
  },
  {
    "query": "Am I eligible for Super Visa if my income is below LICO?"
  },
  {
    "query": "Am I eligible for CUAET if I’m not Ukrainian?"
  },
  {
    "query": "My partner is British and we meet the £29,000 income requirement. Am I eligible for UK Spouse Visa?"
  },
  {
    "query": "I studied online during Covid — can I still get PGWP?"
  },
  {
    "query": "Can I apply for work permit without LMIA?"
  },
  {
    "query": "I have booked a cruise covering Italy and Greece, and have full travel insurance. Am I eligible?"
  }
]